RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL33Z644/include/MKL33Z644_extension.h
/*******************************************************************************
 * LCD_WF8B - LCD Waveform Register 0.
 ******************************************************************************/

/*!
 * @brief LCD_WF8B - LCD Waveform Register 0. (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire LCD_WF8B register
 */
/*@{*/
#define LCD_RD_WF8B(base, index) (LCD_WF8B_REG(base, index))
#define LCD_WR_WF8B(base, index, value) (LCD_WF8B_REG(base, index) = (value))
#define LCD_RMW_WF8B(base, index, mask, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~(mask)) | (value)))
#define LCD_SET_WF8B(base, index, value) (BME_OR8(&LCD_WF8B_REG(base, index), (uint8_t)(value)))
#define LCD_CLR_WF8B(base, index, value) (BME_AND8(&LCD_WF8B_REG(base, index), (uint8_t)(~(value))))
#define LCD_TOG_WF8B(base, index, value) (BME_XOR8(&LCD_WF8B_REG(base, index), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF8B bitfields
 */

/*!
 * @name Register LCD_WF8B, field BPALCD0[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD0 field. */
#define LCD_RD_WF8B_BPALCD0(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD0_MASK) >> LCD_WF8B_BPALCD0_SHIFT)
#define LCD_BRD_WF8B_BPALCD0(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD0_SHIFT, LCD_WF8B_BPALCD0_WIDTH))

/*! @brief Set the BPALCD0 field to a new value. */
#define LCD_WR_WF8B_BPALCD0(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD0_MASK, LCD_WF8B_BPALCD0(value)))
#define LCD_BWR_WF8B_BPALCD0(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD0_SHIFT), LCD_WF8B_BPALCD0_SHIFT, LCD_WF8B_BPALCD0_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD63[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD63 field. */
#define LCD_RD_WF8B_BPALCD63(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD63_MASK) >> LCD_WF8B_BPALCD63_SHIFT)
#define LCD_BRD_WF8B_BPALCD63(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD63_SHIFT, LCD_WF8B_BPALCD63_WIDTH))

/*! @brief Set the BPALCD63 field to a new value. */
#define LCD_WR_WF8B_BPALCD63(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD63_MASK, LCD_WF8B_BPALCD63(value)))
#define LCD_BWR_WF8B_BPALCD63(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD63_SHIFT), LCD_WF8B_BPALCD63_SHIFT, LCD_WF8B_BPALCD63_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD62[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD62 field. */
#define LCD_RD_WF8B_BPALCD62(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD62_MASK) >> LCD_WF8B_BPALCD62_SHIFT)
#define LCD_BRD_WF8B_BPALCD62(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD62_SHIFT, LCD_WF8B_BPALCD62_WIDTH))

/*! @brief Set the BPALCD62 field to a new value. */
#define LCD_WR_WF8B_BPALCD62(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD62_MASK, LCD_WF8B_BPALCD62(value)))
#define LCD_BWR_WF8B_BPALCD62(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD62_SHIFT), LCD_WF8B_BPALCD62_SHIFT, LCD_WF8B_BPALCD62_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD61[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD61 field. */
#define LCD_RD_WF8B_BPALCD61(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD61_MASK) >> LCD_WF8B_BPALCD61_SHIFT)
#define LCD_BRD_WF8B_BPALCD61(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD61_SHIFT, LCD_WF8B_BPALCD61_WIDTH))

/*! @brief Set the BPALCD61 field to a new value. */
#define LCD_WR_WF8B_BPALCD61(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD61_MASK, LCD_WF8B_BPALCD61(value)))
#define LCD_BWR_WF8B_BPALCD61(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD61_SHIFT), LCD_WF8B_BPALCD61_SHIFT, LCD_WF8B_BPALCD61_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD60[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD60 field. */
#define LCD_RD_WF8B_BPALCD60(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD60_MASK) >> LCD_WF8B_BPALCD60_SHIFT)
#define LCD_BRD_WF8B_BPALCD60(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD60_SHIFT, LCD_WF8B_BPALCD60_WIDTH))

/*! @brief Set the BPALCD60 field to a new value. */
#define LCD_WR_WF8B_BPALCD60(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD60_MASK, LCD_WF8B_BPALCD60(value)))
#define LCD_BWR_WF8B_BPALCD60(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD60_SHIFT), LCD_WF8B_BPALCD60_SHIFT, LCD_WF8B_BPALCD60_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD59[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD59 field. */
#define LCD_RD_WF8B_BPALCD59(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD59_MASK) >> LCD_WF8B_BPALCD59_SHIFT)
#define LCD_BRD_WF8B_BPALCD59(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD59_SHIFT, LCD_WF8B_BPALCD59_WIDTH))

/*! @brief Set the BPALCD59 field to a new value. */
#define LCD_WR_WF8B_BPALCD59(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD59_MASK, LCD_WF8B_BPALCD59(value)))
#define LCD_BWR_WF8B_BPALCD59(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD59_SHIFT), LCD_WF8B_BPALCD59_SHIFT, LCD_WF8B_BPALCD59_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD58[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD58 field. */
#define LCD_RD_WF8B_BPALCD58(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD58_MASK) >> LCD_WF8B_BPALCD58_SHIFT)
#define LCD_BRD_WF8B_BPALCD58(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD58_SHIFT, LCD_WF8B_BPALCD58_WIDTH))

/*! @brief Set the BPALCD58 field to a new value. */
#define LCD_WR_WF8B_BPALCD58(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD58_MASK, LCD_WF8B_BPALCD58(value)))
#define LCD_BWR_WF8B_BPALCD58(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD58_SHIFT), LCD_WF8B_BPALCD58_SHIFT, LCD_WF8B_BPALCD58_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD57[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD57 field. */
#define LCD_RD_WF8B_BPALCD57(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD57_MASK) >> LCD_WF8B_BPALCD57_SHIFT)
#define LCD_BRD_WF8B_BPALCD57(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD57_SHIFT, LCD_WF8B_BPALCD57_WIDTH))

