RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL33Z644/include/MKL33Z644_extension.h
/*! @brief Set the BPGLCD31 field to a new value. */
#define LCD_WR_WF8B_BPGLCD31(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD31_MASK, LCD_WF8B_BPGLCD31(value)))
#define LCD_BWR_WF8B_BPGLCD31(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD31_SHIFT), LCD_WF8B_BPGLCD31_SHIFT, LCD_WF8B_BPGLCD31_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD43[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD43 field. */
#define LCD_RD_WF8B_BPGLCD43(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD43_MASK) >> LCD_WF8B_BPGLCD43_SHIFT)
#define LCD_BRD_WF8B_BPGLCD43(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD43_SHIFT, LCD_WF8B_BPGLCD43_WIDTH))

/*! @brief Set the BPGLCD43 field to a new value. */
#define LCD_WR_WF8B_BPGLCD43(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD43_MASK, LCD_WF8B_BPGLCD43(value)))
#define LCD_BWR_WF8B_BPGLCD43(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD43_SHIFT), LCD_WF8B_BPGLCD43_SHIFT, LCD_WF8B_BPGLCD43_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD32[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD32 field. */
#define LCD_RD_WF8B_BPGLCD32(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD32_MASK) >> LCD_WF8B_BPGLCD32_SHIFT)
#define LCD_BRD_WF8B_BPGLCD32(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD32_SHIFT, LCD_WF8B_BPGLCD32_WIDTH))

/*! @brief Set the BPGLCD32 field to a new value. */
#define LCD_WR_WF8B_BPGLCD32(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD32_MASK, LCD_WF8B_BPGLCD32(value)))
#define LCD_BWR_WF8B_BPGLCD32(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD32_SHIFT), LCD_WF8B_BPGLCD32_SHIFT, LCD_WF8B_BPGLCD32_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD33[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD33 field. */
#define LCD_RD_WF8B_BPGLCD33(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD33_MASK) >> LCD_WF8B_BPGLCD33_SHIFT)
#define LCD_BRD_WF8B_BPGLCD33(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD33_SHIFT, LCD_WF8B_BPGLCD33_WIDTH))

/*! @brief Set the BPGLCD33 field to a new value. */
#define LCD_WR_WF8B_BPGLCD33(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD33_MASK, LCD_WF8B_BPGLCD33(value)))
#define LCD_BWR_WF8B_BPGLCD33(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD33_SHIFT), LCD_WF8B_BPGLCD33_SHIFT, LCD_WF8B_BPGLCD33_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD42[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD42 field. */
#define LCD_RD_WF8B_BPGLCD42(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD42_MASK) >> LCD_WF8B_BPGLCD42_SHIFT)
#define LCD_BRD_WF8B_BPGLCD42(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD42_SHIFT, LCD_WF8B_BPGLCD42_WIDTH))

/*! @brief Set the BPGLCD42 field to a new value. */
#define LCD_WR_WF8B_BPGLCD42(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD42_MASK, LCD_WF8B_BPGLCD42(value)))
#define LCD_BWR_WF8B_BPGLCD42(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD42_SHIFT), LCD_WF8B_BPGLCD42_SHIFT, LCD_WF8B_BPGLCD42_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD34[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD34 field. */
#define LCD_RD_WF8B_BPGLCD34(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD34_MASK) >> LCD_WF8B_BPGLCD34_SHIFT)
#define LCD_BRD_WF8B_BPGLCD34(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD34_SHIFT, LCD_WF8B_BPGLCD34_WIDTH))

/*! @brief Set the BPGLCD34 field to a new value. */
#define LCD_WR_WF8B_BPGLCD34(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD34_MASK, LCD_WF8B_BPGLCD34(value)))
#define LCD_BWR_WF8B_BPGLCD34(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD34_SHIFT), LCD_WF8B_BPGLCD34_SHIFT, LCD_WF8B_BPGLCD34_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD11[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD11 field. */
#define LCD_RD_WF8B_BPGLCD11(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD11_MASK) >> LCD_WF8B_BPGLCD11_SHIFT)
#define LCD_BRD_WF8B_BPGLCD11(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD11_SHIFT, LCD_WF8B_BPGLCD11_WIDTH))

/*! @brief Set the BPGLCD11 field to a new value. */
#define LCD_WR_WF8B_BPGLCD11(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD11_MASK, LCD_WF8B_BPGLCD11(value)))
#define LCD_BWR_WF8B_BPGLCD11(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD11_SHIFT), LCD_WF8B_BPGLCD11_SHIFT, LCD_WF8B_BPGLCD11_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD35[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD35 field. */
#define LCD_RD_WF8B_BPGLCD35(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD35_MASK) >> LCD_WF8B_BPGLCD35_SHIFT)
#define LCD_BRD_WF8B_BPGLCD35(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD35_SHIFT, LCD_WF8B_BPGLCD35_WIDTH))

/*! @brief Set the BPGLCD35 field to a new value. */
#define LCD_WR_WF8B_BPGLCD35(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD35_MASK, LCD_WF8B_BPGLCD35(value)))
#define LCD_BWR_WF8B_BPGLCD35(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD35_SHIFT), LCD_WF8B_BPGLCD35_SHIFT, LCD_WF8B_BPGLCD35_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD12[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD12 field. */
#define LCD_RD_WF8B_BPGLCD12(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD12_MASK) >> LCD_WF8B_BPGLCD12_SHIFT)
#define LCD_BRD_WF8B_BPGLCD12(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD12_SHIFT, LCD_WF8B_BPGLCD12_WIDTH))

/*! @brief Set the BPGLCD12 field to a new value. */
#define LCD_WR_WF8B_BPGLCD12(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD12_MASK, LCD_WF8B_BPGLCD12(value)))
#define LCD_BWR_WF8B_BPGLCD12(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD12_SHIFT), LCD_WF8B_BPGLCD12_SHIFT, LCD_WF8B_BPGLCD12_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD41[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD41 field. */
#define LCD_RD_WF8B_BPGLCD41(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD41_MASK) >> LCD_WF8B_BPGLCD41_SHIFT)
#define LCD_BRD_WF8B_BPGLCD41(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD41_SHIFT, LCD_WF8B_BPGLCD41_WIDTH))

/*! @brief Set the BPGLCD41 field to a new value. */
#define LCD_WR_WF8B_BPGLCD41(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD41_MASK, LCD_WF8B_BPGLCD41(value)))
#define LCD_BWR_WF8B_BPGLCD41(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD41_SHIFT), LCD_WF8B_BPGLCD41_SHIFT, LCD_WF8B_BPGLCD41_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD36[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD36 field. */
#define LCD_RD_WF8B_BPGLCD36(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD36_MASK) >> LCD_WF8B_BPGLCD36_SHIFT)
#define LCD_BRD_WF8B_BPGLCD36(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD36_SHIFT, LCD_WF8B_BPGLCD36_WIDTH))

/*! @brief Set the BPGLCD36 field to a new value. */
#define LCD_WR_WF8B_BPGLCD36(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD36_MASK, LCD_WF8B_BPGLCD36(value)))
#define LCD_BWR_WF8B_BPGLCD36(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD36_SHIFT), LCD_WF8B_BPGLCD36_SHIFT, LCD_WF8B_BPGLCD36_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD3[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD3 field. */
#define LCD_RD_WF8B_BPGLCD3(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD3_MASK) >> LCD_WF8B_BPGLCD3_SHIFT)
#define LCD_BRD_WF8B_BPGLCD3(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD3_SHIFT, LCD_WF8B_BPGLCD3_WIDTH))

